class MyDate {
  final String name;
  final String Ename;
  final String image;
  final String text;
  MyDate(
      {required this.name,
      required this.Ename,
      required this.image,
      required this.text});
}

final infor = <MyDate>[
  MyDate(
      name: "مسجد جامع هرات",
      Ename: "Herat Grand Mosque",
      image: "image/images.jfif",
      text: ''' 
      مسجد جامع هرات (دگرنام: مسجد جمعه هرات) کهن‌ترین مسجد در هرات است که بسیار بازسازی شده‌است. بیشتر گسترش آن در دورهٔ طلایی عهد تیموریان بود.
این مسجد را سلطان غیاث الدین غوری در سال ۵۹۷ ق. طرح‌ریزی نمود اما موفق به تکمیل آن نشد. جسد وی در سال ۱۲۰۲ میلادی در زیر گنبد در پشت ایوان شمالی مسجد مدفون گردیده‌است.

تنها بخش کوچکی از مسجد عهد غوریان در درب ورودی جنوبی باقی مانده‌اس
      '''),
  MyDate(
      name: "منار جام",
      Ename: "Minar Jam",
      image: "image/manar.jpg",
      text:
          ''' منار جام در مناطق کوهستانی ولایت غور در ۶۲ کیلومتری منطقه «شهرک» در روستای موسوم به «جام»، محلی که رودخانه جام از جنوب به طرف شمال به رودخانه خروشان «هریرود» جریان دارد و در زاویه تلاقی این دو رودخانه قرار دارد.[۱]

این منار در سده دوازدهم میلادی ساخته شده و ۶۵ متر ارتفاع دارد و در سال ۲۰۰۲ مرکز حفظ میراث جهانی یونسکو خواستار ثبت این منار در فهرست میراث فرهنگی جهان شد. این بنا بعد از قطب منار در دهلی نو، هندوستان بلندترین مناره خشتی جهان است.[۲]

منار کهنسال و تاریخی جام در حال فرسایش است فرانچسکو بندارین مدیر این مرکز دربارهٔ منار جام گفته‌است که این منار، «احتمالاً یکی از سازه‌های خارق‌العاده معماری و کهنسال‌ترین برج آجری باقی مانده در جهان است.»

یونسکو می‌گوید به دلیل جریان آب در رودخانه‌ای که در نزدیکی منار جام قرار دارد، این منار بزرگ، در حال فرسایش است.

مکان'''),
  MyDate(
      name: "ارگ هرات",
      Ename: "Herat Citadel",
      image: "image/arg.jpg",
      text: '''
  قلعه اختیار الدین هرات

قلعه‌ی تاریخی اختیارالدین که به قلعه اسکندر مقدونی یا ارگ هرات معروف است، یکی از قدیمی‌ترین قلعه‌‌‏ها در افغانستان است. قلعه‌ای که قدمت تاریخی زیادی دارد و از بقایای حکومت بلند مدت اسکندر مقدونی در این سرزمین است.

این مکان تاریخی بر اثر جنگ‌های داخلی و حوادث طبیعی چندین بار تخریب شده اما دوباره توسط شماری از نهادهای بخش باستانی بازسازی شده است.
یکی از دلایلی که این قلعه به اسم قلعه اختیار الدین معروف گشته است این است که در سال ۷۰۵ هجری قمری و در زمان سلسله کرت فردی به نام ملک فخرالدین قلعه را بازسازی نمود و بپاس خدمات اختیار الدین که در این راه کمک کرده بود این قلعه را به نام وی نامگذاری نمود.

این مکان تاریخی در زمان که امیر تیمور گورکانی در ۷۸۵ هجری قمری هرات را تصرف کرد میان دیوار قلعه و دیواراصلی شهر فاصله ایجاد کرد که این بنا از تهدیدهای موجود محفوظ شود. بعد از آن شاهرخ میرزای تیموری در ۸۱۸ هجری قمری فرمان داد تا حصار را از خشت پخته، سنگ و آهنگ بنا کنند، او این بنا را به مرکز فرهنگی و نظامی‌اش تبدیل کرد.

قلعه‌ی تاریخی اختیارالدین دارای دو بخش غربی و شرقی است که در قسمت شرقی آن حرم‌سرای شاهان و قلعه پایینی آن در سمت غربی قرارگاه نظامیان بوده است. مساحت این قصر تاریخی ۵هزار متر مربع بوده و دارای ۱۳ برج می‌باشد که از خشت خام ساخته شده.

قلعه در قسمت شمالی شهر بین محل «قطبیچاق» و محله «بردارانی‌ها» بر روی تپه‌ای بلند واقع شده است.
قلعه اختیارالدین در زمان سردار محمد داوود خان درسال ۱۳۴۲ شمسی برای اولین بار توسط سازمان یونسکو بازسازی گردیده که با کودتای هفت ثور و آغاز جنگ، این قلعه تبدیل به مرکز نظامی تبدیل شد.

قلعه اختیارالدین در سالهای اخیر به عنوان محل موزه شهر هرات استفاده می‌شده است و به تازگی با تخلیه قلعه اختیارالدین از تجهیزات نظامی به موزه تبدیل شده است.
در داخل این قلعه باستانی، موزه هرات قرار دارد که همیشه به روی شهروندان و توریست‌‌‏ها خارجی باز است.
آثار باستانی موزه قلعه اختیارالدین، بازمانده‌هایی از دوره حکومت غزنویان، غوریان، تیموریان و ملکوک‌کرت است که شامل کاشی، سنگ، فلز، سفال و چوب به شکل‌های متفاوت مثل مجسمه‌ حیوانات، سکه‌، سلاح‌های جنگی، زیورآلات و ظرف‌خانه می‌گردد.
  '''),
  MyDate(
      name: "آرامگاه خواجه عبدالله انصاری",
      Ename: "Tomb of Khwaja Abdullah Ansari",
      image: "image/ima.jfif",
      text:
          ''' دامنه کوهی در شمال شهر هرات، فرزند ابوایوب انصاری صحابه پیامبراکرم (ص) به نام خواجه عبدالله انصاری آرمیده است، آرامگاهی که از جایگاه خاصی درمیان مردم افغانستان بخصوص شهروندان هراتی برخودار است.
به گزارش گروه بین‌الملل خبرگزاری تسنیم، خواجه عبدالله محمد بن انصاری هروی در سال 396 هـ.ق در زمان سلطنت «آلب ارسلان سلجوقی» و وزارت «خواجه نظام الملک» وزیر دانشمند، دانش پرور و هنرشناس وقت به دنیا آمد و در سال 481 هـ.ق درگذشت که در «گازرگاه» هرات به خاک سپرده شد.

پدر او «ابومنصور انصاری» از فرزندان ابوایوب انصاری است که حضرت رسول اکرم صلی‌الله‌ علیه‌ و آله‌ و سلم هنگام هجرت به مدینه، در منزل او وارد شدند همچنین مادرش نیز از مردم بلخ بود.'''),
  MyDate(
      name: "مقبره گوهر شاد",
      Ename: "Tomb of Goharshad Begum",
      image: "image/oad.jfif",
      text:
          '''گنبد گوهرشاد یا گنبد سبز، مقبره ایست متصل به مدرسه، مسجد و مصلی های خیابان هرات که بنای آن یادآور مفهوم کامل میهن دوستیست و شخصی را به یاد مردم افغانستان می آورد که عشق به وطن و مردمش در تار و پود وجودش موج میزد. بانو گوهرشاد بیگم، همسر تیمور شاه که از هیچ کاری برای آبادانی کشورش دریغ نکرد، دستور ساخت این بنا را داد و سرانجام نیز، خود و دو پسرش و نوه پسری اش در این مکان دفن شدند و اکنون، این مجموعه تاریخی به مکانی تبدیل شده که گردشگران زیادی را از سراسر دنیا به خود جذب می کند. هرچند که متاسفانه هم اکنون از آن بنای باشکوه تنها همان گنبد سبز و پنج مناره باقی مانده است.

 رزرو اقامتگاه در هرات'''),
  MyDate(
      name: "منظر جهاد هرات ",
      Ename: "Herat Museum",
      image: "image/moziam.jfif",
      text:
          ''' موزه جهاد در مرکز ولایت غربی هرات در افغانستان واقع شده‌است. این بنا در سال ۲۰۱۰ به عنوان مکانی برای درک افغان‌ها از درگیری‌های گذشته و تاریخچه آنها ساخته شده‌است. از زمان افتتاح این موزه بازدیدکنندگان بسیاری داشته‌است که از آن جمله اعضای کنگره آمریکا و معاون فرمانده نیروهای'''),
  MyDate(
      name: "بت های بامیان",
      Ename: "Bamiyan idols",
      image: "image/bot.jfif",
      text:
          '''مجسمه‌های بودا در بامیان اشاره به تندیسهای بزرگی که در دل کوه در استان بامیان افغانستان ساخته شده بودند دارد. بنای ایستادهٔ این مجسمه‌های تاریخی در کناره‌های صخره‌ای هنگام رواج آیین بودایی در افغانستان در درهٔ بامیان کنده کاری شده بودند. مختصات جغرافیایی مکان این مجسمه‌ها از کابل در حدود ۲۳۰ کیلومتر (۱۴۰ مایل) به طرف شمال غربی بوده‌است. این دو مجسمه به بلندی ۵۳ متر و ۳۵ متر، در کنار مجموعه‌ای از بناهای تاریخی در این محل برای زمانی طولانی از جاذبه‌های اصلی گردشگری در افغانستان بودند.[۳] تندیس کوچکتر در سال ۵۰۷ میلادی و تندیس بزرگتر در سال ۵۵۴ میلادی ساخته شده‌است.[۴] این دو تندیس، نشان‌دهندهٔ سبک کهن هنر یونانی و بودایی بوده‌است؛ که در مناطق آسیای مرکزی به ویژه در افغانستان رواج داشته‌است'''),
  MyDate(
      name: "پل مالان هرات",
      Ename: "Herat's Malan Bridge",
      image: "image/poll.jfif",
      text:
          '''یکی از قدیمی ترین و زیباترین پل های افغانستان پل ملان می ­باشد که بر روی رودخانه هریرود در منطقه مالان هرات که قدمت آن به دوران قبل از اسلام و همزمان با شکل گیری شهر هرات می­باشد، درست شده است.
ملان یک روستای کوچک در نزدیکی هریرود می باشد که طبق منابع تاریخی در دوران قبل از اسلام یک آتشکده ای در آنجا وجود داشت که مردم شهر هرات در آن به پرستش مشغول بودند. این پل بر روی یکی از مسیرهای قدیمی هرات -قندهار ساخته شده است که کاروان های زیادی از هرات که عازم سیستان، قندهار و هندوستان بودند از این مسیر عبور می­کردند. به طوری که قبل از احداث پل پشتو (پشتون) در سال ۱۳۴۰ تنها پلی که مسیر هرات - قندهار را پیوند می‌زد، پل مالان بود.

علاوه بر اهمیت پل مالان در راه های مواصلاتی ، نمیتوان از نقش اقتصادی این پل در ایجاد درآمد برای مردم هرات چشم پوشی کرد. در طول تاریخ این پل چندین بار مرمت شده است .به عنوان مثال در سال ۵۰۵ هجری و در دوران سلطان "سنجار سلجوقی"، این پل با یه تغییرات کوچکی تعمیر شد.

در حال حاضر پل مالان دارای ۲۲ تا زیرگذر می­باشد. و در حال حاضر عبور و مرور مردم "گذره" و "انجبیل" از بالای این پل صورت می­گیرد. "الکساندر همیلتون" توریست انلگلیسی که در اواخر قرن ۱۹ از شهر هرات بازدید داشت تعداد زیرگذر های این پل را ۱۹ عدد نوشته است. این توریست همچنین گزارشهایی که از شهر هرات و پل مالان را داشته است در سال ۱۹۰۴ در انگلستان به چاپ رساند.

 '''),
  MyDate(
      name: "منار های هرات",
      Ename: "The minarets of Herat",
      image: "image/manar.jpg",
      text: '''مناره های هرات 
در این مطلب از مجله گردشگری هم اقلیم شما را با مناره های هرات در افغانستان آشنا خواهیم کرد. در ادامه همراه ما باشید.

مناره های هرات که یادآور روزهای قدیم افغانستان است، چشم هر رهگذری را از دور مجذوب می کند. چهار منار هرات در هنر معماری تیموری در افغانستان نقش به سزایی داشته و هنوز که هنوزِ، بعد از این همه سال به عنوان نگین هرات برای تاریخ نویسان و گردشگران دارای اهمیت است و آرزوی هر گردشگری، بازدید از این آثار ارزشمند است.

photo ۲۰۲۰ ۱۱ ۱۰ ۱۲ ۲۴ ۱۷
هرات نزدیک به ۸۰۰ بنا و اثر تاریخی را در خود جای داده که در این بین مناره‌های هرات از اهمیت زیادی برخوردار هستند. به تازگی وزارت اطلاعات و فرهنگ افغانستان دستور تشکیل کمیته اضطراری برای جلوگیری از فروپاشی مناره پنجم را صادر کرده است.'''),
  MyDate(
      name: "تخت صفر هرات",
      Ename: "Takht safar Herat",
      image: "image/akht.jfif",
      text:
          '''تخت صفر، مقصد اصلی گردش‌گرانی است که از شلوغی شهر به فضای دل‌نشین آن پناه می‌برند. یکی از قدیمی‌ترین مکان‌های تفریحی هرات که بر فراز تپه‌های شمال شهر جای خوش کرده و ساکنان دیگر ولایت‎‌ها هم به تماشای آن می‌آیند.

بر اساس روایت‌های تاریخی، تخت صفر در زمان تیموریان به درخواست گوهرشادبیگم ساخته شد تا گاوچرانی به نام «ملاصفر» بر تکه سنگی بنشیند و گله‌اش را تماشا کند.

اهمیت این تفرج‌گاه به حدی بوده که شاعران قدیمی هم در وصفش شعر سروده و زیبایی آن را بیان کرده‌اند.

ناظم هروی شاعر نام‌دار هراتی در وصف «تخت صفر» چنین گفته است:

بر تخت صفر چو پا گذاری

پا بر خط استوا گذاری

تا سبزه او ز سنگ رسته

یک گل به هزار رنگ دسته

سال‌ها پس از ساخت بزرگ‌ترین تفریح‌گاه غرب کشور جوانان و خانواده‌ها تا نیمه‌های شب در آن به سیر و سیاحت می‌پردازند.'''),
];
